Tekla Open API Reference for Tekla Structures 2025
Distance Constructor
Overload List
Name | Description
Distance(Double)
 Initializes a new instance of the structure.
Distance(Double, Distance.UnitType)
 Initializes a new instance of the structure.
Top
See Also
Reference
Distance Structure
Tekla.Structures.Datatype Namespace